insert into genres (title, description, language)
values ('Басня',
        'Стихотворное или прозаическое литературное произведение нравоучительного, сатирического характера. В конце басни содержится краткое нравоучительное заключение - так называемая мораль.',
        'ru-RU');

insert into genres (title, description, language)
values ('Баллада',
        'Это лиро-эпическое произведение, т. е. рассказ, изложенный в поэтической форме, исторического, мифического или героического характера. Сюжет баллады обычно заимствуется из фольклора.',
        'ru-RU');

insert into genres (title, description, language)
values ('Былины',
        'Это героико-патриотические песни-сказания, повествующие о подвигах богатырей и отражающие жизнь Древней Руси IX—XIII веков; вид устного народного творчества, которому присущ песенно-эпический способ отражения действительности.',
        'ru-RU');

insert into genres (title, description, language)
values ('Видения',
        'Это жанр средневековой литературы, который характеризуется, с одной стороны, наличием образа «ясновидца» в центре повествования и загробным, потусторонним, эсхатологическим содержанием самих зрительных образов, явленных ясновидцу, — с другой.',
        'ru-RU');

insert into genres (title, description, language)
values ('Детектив',
        'Это преимущественно литературный жанр, произведения которого описывают процесс исследования загадочного происшествия с целью выяснения его обстоятельств и раскрытия загадки.',
        'ru-RU');

insert into genres (title, description, language)
values ('Комедия',
        'Вид драматургического произведения. Отображает все уродливое и нелепое, смешное и несуразное, высмеивает пороки общества.',
        'ru-RU');

insert into genres (title, description, language)
values ('Комедия нравов (комедия характеров)',
        'Это комедия, в которой источником смешного является внутренняя суть характеров и нравов высшего света, смешная и уродливая однобокость, гипертрофированная черта или страсть (порок, недостаток). Очень часто комедия нравов является сатирической комедией, которая высмеивает все эти человеческие качества.',
        'ru-RU');

insert into genres (title, description, language)
values ('Лирическое стихотворение (в прозе)',
        'Вид художественной литературы, эмоционально и поэтически выражающий чувства автора.',
        'ru-RU');

insert into genres (title, description, language)
values ('Мелодрама',
        'Вид драмы, действующие лица которой резко делятся на положительных и отрицательных.',
        'ru-RU');

insert into genres (title, description, language)
values ('Миф',
        'Это повествование, передающее представления людей о мире, месте человека в нём, о происхождении всего сущего, о богах и героях.',
        'ru-RU');

insert into genres (title, description, language)
values ('Очерк',
        'Самый достоверный вид повествовательной, эпической литературы, отображающий факты из реальной жизни.',
        'ru-RU');

insert into genres (title, description, language)
values ('Научная фантастика ',
        'Жанр в литературе, и других видах искусства, одна из разновидностей фантастики. Научная фантастика основывается на фантастических допущениях (вымысле) в области науки, включая различные виды наук, такие как: точные, естественные, и гуманитарные науки.',
        'ru-RU');

insert into genres (title, description, language)
values ('Новелла',
        'Это основной жанр малой повествовательной прозы, более краткая форма художественной прозы, нежели повесть или роман. Автора рассказов принято именуют новеллистом, а совокупность рассказов — новеллистикой.',
        'ru-RU');

insert into genres (title, description, language)
values ('Повесть',
        'Средняя форма; произведение, в котором освещается ряд событий в жизни главного героя.',
        'ru-RU');

insert into genres (title, description, language)
values ('Ода',
        'Жанр лирики, который представляет собою торжественное стихотворение, посвященное какому-либо событию или герою, или отдельное произведение такого жанра.',
        'ru-RU');

insert into genres (title, description, language)
values ('Поэма',
        'Вид лироэпического произведения; стихотворное сюжетное повествование.',
        'ru-RU');

insert into genres (title, description, language)
values ('Послание (эпистолярная литература)',
        'Это литературный жанр, в котором используется форма «писем» или «посланий».',
        'ru-RU');

insert into genres (title, description, language)
values ('Рассказ',
        'Малая форма, произведение об одном событии в жизни персонажа.',
        'ru-RU');

insert into genres (title, description, language)
values ('Сказка',
        'Это жанр литературного творчества, чаще всего в сказках присутствует волшебство и различные невероятные приключения.',
        'ru-RU');

insert into genres (title, description, language)
values ('Трагедия',
        'Вид драматургического произведения, рассказывающего о несчастной судьбе главного героя, часто обреченного на смерть.',
        'ru-RU');

insert into genres (title, description, language)
values ('Фольклор',
        'Вид народного искусства, который отражает общие закономерности общественного развития народов. В фольклоре существует три рода произведений: эпические, лирические и драматические. При этом эпические жанры имеют стихотворную и прозаическую форму (в ли­тературе эпический род представлен только прозаическими произведениями: рассказ, повесть, ро­ман и т. д.). Особенностью фольклора является его традиционализм и ориентация на устный способ передачи информации. Носителями обычно выступали сельские жители (крестьяне).',
        'ru-RU');

insert into genres (title, description, language)
values ('Эпопея',
        'Произведение или цикл произведений, изображающих значительную историческую эпоху либо большое историческое событие.',
        'ru-RU');

insert into genres (title, description, language)
values ('Элегия',
        'Лирический жанр, который содержится в свободной стихотворной форме какую-либо жалобу, выражение печали, или эмоциональный результат философского раздумья над сложными проблемами жизни.',
        'ru-RU');

insert into genres (title, description, language)
values ('Эпиграмма',
        'Это небольшое сатирическое стихотворение, высмеивающее какое-либо лицо или общественное явление.',
        'ru-RU');

insert into genres (title, description, language)
values ('Эпос',
        'Это героическое повествование о прошлом, содержащее целостную картину народной жизни и представляющее в гармоническом единстве некий эпический мир героев-богатырей.',
        'ru-RU');

insert into genres (title, description, language)
values ('Эссе',
        'Это литературный жанр, прозаическое сочинение небольшого объёма и свободной композиции.',
        'ru-RU');

insert into genres (title, description, language)
values ('Роман',
        'большая форма; произведение, в событиях которого обычно принимает участие много действующих лиц, чьи судьбы переплетаются. Романы бывают философские, приключенческие, исторические, семейно-бытовые, социальные.',
        'ru-RU');

insert into genres (title, description, language)
values ('Программирование',
        'Литература по программированию и миру IT.',
        'ru-RU');

insert into genres (title, description, language)
values ('Научная литература',
        'Литература, совокупность письменных трудов, которые созданы в результате исследований, теоретических обобщений, сделанных в рамках научного метода.',
        'ru-RU');