insert into books (user_id, genre_id, title, author, description, publisher, year, isbn, number_of_pages, cover_type, cover)
values (1,
        2,
        'Математика профиль. Решение сложных неравенств к экзамену 2021',
        'Поцелуев К.',
        'Книга содержит в себе подробный разбор всех типовых задач по 15 заданию ЕГЭ (решение неравенств), которые встречаются в рамках профильного ЕГЭ по математике. Также разобрано много вспомогательных задач для усвоения более сложных. Все приведенные задачи соответствуют уровню сложности ЕГЭ. Подавляющее большинство задач этой книги предлагалось на экзамене в последнем году по разным регионам страны. В книге показаны методы быстрого решения, необходимые на экзамене. Подробность изложения материала позволяет готовиться по этой теме даже менее уверенным в своих силах ученикам. Также книга может служить пособием для учителей при подготовке по теме «15 задание ЕГЭ - решение сложных неравенств». Условия большинства этих задач составлены с ориентиром на уровень сложности, рекомендуемый ФИПИ при подготовке к экзамену. Все приведенные решения в данном сборнике - авторские.',
        'Publisher',
        2000,
        '978-5-9614-6526-6',
        300,
        'soft',
        'https://img-gorod.ru/25/833/2583367_detail.jpg');
