insert into books (user_id,
                   genre_id,
                   image,
                   title,
                   author,
                   publisher,
                   isbn,
                   year,
                   number_of_pages,
                   description,
                   cover_type,
                   sale,
                   enabled)
values (
           # user_id
           '2',
           # genre_id
           '57',
           # image
           'https://mylibraryapp.com/images/9bd61984-8819-4093-9014-8b494dc24886.png',
           # title
           'Иммануил Кант',
           # author
           'Иммануил Кант',
           # publisher
           'Эксмо',
           # isbn
           '978-5-04-091830-0',
           # year
           '2018',
           # number_of_pages
           '464',
           # description
           'Иммануил Кант — великий философ, родоначальник немецкой классической философии. Мы отобрали для вас несколько фрагментов из самых известных и значимых его работ: «Критика чистого разума», «Критика практического разума» и «Критика способности суждения».',
           # cover_type
           'Solid',
           # sale
           '0',
           # enabled
           '1'
       );

insert into books (user_id,
                   genre_id,
                   image,
                   title,
                   author,
                   publisher,
                   isbn,
                   year,
                   number_of_pages,
                   description,
                   cover_type,
                   sale,
                   enabled)
values (
           # user_id
           '2',
           # genre_id
           '56',
           # image
           'https://mylibraryapp.com/images/9be37ffe-b199-4a14-b8bf-ca80c95bf85e.png',
           # title
           'Реактивное программирование с использованием RxJava',
           # author
           'Томаш Нуркевич, Бен Кристенсен',
           # publisher
           'O''Reilly',
           # isbn
           '978-5-97060-496-0',
           # year
           '2017',
           # number_of_pages
           '358',
           # description
           'В наши дни, когда программы асинхронны, а быстрая реакция - важнейшее свойство, реактивное программирование поможет писать более надежный, лучше масштабируемый и быстрее работающий код. Благодаря этой книге программист на Java узнает о реактивном подходе к задачам и научится создавать программы, вобравшие в себя лучшие черты этой новой и весьма перспективной парадигмы. Данная книга содержит глубокое и подробное изложение концепций и принципов использования реактивного программирования вообще и RxJava в частности.',
           # cover_type
           'Soft',
           # sale
           '0',
           # enabled
           '1'
       );

insert into books (user_id,
                   genre_id,
                   image,
                   title,
                   author,
                   publisher,
                   isbn,
                   year,
                   number_of_pages,
                   description,
                   cover_type,
                   sale,
                   enabled)
values (
           # user_id
           '2',
           # genre_id
           '57',
           # image
           'https://mylibraryapp.com/images/68ad122f-5b75-4d4e-9cc9-261226770fb6.png',
           # title
           'Структура и смысл: Теория литературы для всех',
           # author
           'И. Н. Сухих',
           # publisher
           'Азбука-Аттикус',
           # isbn
           '978-5-389-12823-1',
           # year
           '2016',
           # number_of_pages
           '660',
           # description
           'Игорь Николаевич Сухих (р. 1952) – доктор филологических наук, профессор Санкт-Петербургского университета, писатель, критик. Автор более 500 научных работ по истории русской литературы XIX–XX веков, в том числе монографий «Проблемы поэтики Чехова» (1987, 2007), «Сергей Довлатов: Время, место, судьба» (1996, 2006, 2010), «Книги ХХ века. Русский канон» (2001), «Проза советского века: три судьбы. Бабель. Булгаков. Зощенко» (2012), «Русский канон. Книги ХХ века» (2012), «От… и до…: Этюды о русской словесности» (2015) и др., а также полюбившихся школьникам и учителям учебников по литературе. Книга «Структура и смысл: Теория литературы для всех» стала результатом исследовательского и преподавательского опыта И. Н. Сухих. Ее можно поставить в один ряд с учебными пособиями по введению в литературоведение, но она имеет по крайней мере три существенных отличия. Во-первых, эту книгу интересно читать, а не только учиться по ней; во-вторых, в ней успешно сочетаются теория и практика: в разделе «Иллюстрации» помещены статьи, посвященные частным вопросам литературоведения; а в-третьих, при всей академичности изложения книга адресована самому широкому кругу читателей.',
           # cover_type
           'Solid',
           # sale
           '0',
           # enabled
           '1'
       );

insert into books (user_id,
                   genre_id,
                   image,
                   title,
                   author,
                   publisher,
                   isbn,
                   year,
                   number_of_pages,
                   description,
                   cover_type,
                   sale,
                   enabled)
values (
           # user_id
           '2',
           # genre_id
           '57',
           # image
           'https://mylibraryapp.com/images/73f83507-f345-4ac8-8cf0-67175e42a1fb.png',
           # title
           'Краткая история США',
           # author
           'Римини Роберт',
           # publisher
           'КоЛибри',
           # isbn
           '978-5-389-07121-6',
           # year
           '2020',
           # number_of_pages
           '480',
           # description
           'История США была бурной, кровавой и захватывающей. Начиная с эпохи Великих географических открытий, когда отчаянные мореплаватели отправлялись за сказочными богатствами к неизведанным берегам, эти края пережили немало потрясений: колонизация и Война за независимость, Гражданская война и освоение Дикого Запада, развитие промышленности и Великая депрессия… Земля мечты, земля надежды, эта страна стала домом для иммигрантов со всего света — авантюристов, золотоискателей и просто искателей лучшей доли, которые принесли с собой свои обычаи и традиции. История США не похожа ни на какую другую, она читается как приключенческий роман, повествующий о невероятных и увлекательных событиях.',
           # cover_type
           'Solid',
           # sale
           '0',
           # enabled
           '1'
       );

insert into books (user_id,
                   genre_id,
                   image,
                   title,
                   author,
                   publisher,
                   isbn,
                   year,
                   number_of_pages,
                   description,
                   cover_type,
                   sale,
                   enabled)
values (
           # user_id
           '2',
           # genre_id
           '56',
           # image
           'https://mylibraryapp.com/images/567e5a6e-b11c-41d1-8bee-250ff3f72c99.png',
           # title
           'Волшебство Kotlin',
           # author
           'Симон Пьер-Ив',
           # publisher
           'ДМК Пресс',
           # isbn
           '978-5-97060-801-2',
           # year
           '2020',
           # number_of_pages
           '536',
           # description
           'Kotlin - один из самых новых языков в экосистеме Java, устраняющий многие ограничения Java и гораздо более универсальный. Среди его преимуществ: полная совместимость с Java и возможность интеграции на уровне исходного кода, широкая поддержка парадигмы функционального программирования, помогающая писать надежный и безопасный код, лаконичность синтаксиса, а также, что весьма немаловажно, гарантии поддержки со стороны IT-гиганта Google. Пьер-Ив Сомон, опытный разработчик на Java, в своей книге подробно освещает нюансы программирования на Kotlin, переходя от общего описания языка к его характерным особенностям и возможностям, включая приемы функционального программирования. Издание предназначено для разработчиков, знакомых с Java и стремящихся повысить безопасность своих программ, а также упростить их написание, тестирование и сопровождение.',
           # cover_type
           'Solid',
           # sale
           '0',
           # enabled
           '1'
       );

insert into books (user_id,
                   genre_id,
                   image,
                   title,
                   author,
                   publisher,
                   isbn,
                   year,
                   number_of_pages,
                   description,
                   cover_type,
                   sale,
                   enabled)
values (
           # user_id
           '2',
           # genre_id
           '57',
           # image
           'https://mylibraryapp.com/images/8510b9fb-1606-4bba-9740-9890614d88c5.png',
           # title
           'Платон',
           # author
           'Платон',
           # publisher
           'Эксмо',
           # isbn
           '978-5-04-094437-8',
           # year
           '2019',
           # number_of_pages
           '560',
           # description
           'Платон, как ученик Сократа, ставил во главу угла диалог, сомнение в авторитетах и совместный с оппонентом поиск истины. В знаменитых «Диалогах» Платона отражено и учение самого философа, и идеи Сократа, и величие человеческого духа, и диалектический способ познания, который он применял. Популярные философские идеи того времени, поиск истины в дискуссии, управление государством и добродетели человека, любовь и искусство — вот круг тем, которые интересовали лучших представителей рода человеческого две с половиной тысячи лет назад! Много ли изменилось с тех пор? И это ли не повод, чтобы прочитать «Диалоги» сегодня?',
           # cover_type
           'Solid',
           # sale
           '0',
           # enabled
           '1'
       );

insert into books (user_id,
                   genre_id,
                   image,
                   title,
                   author,
                   publisher,
                   isbn,
                   year,
                   number_of_pages,
                   description,
                   cover_type,
                   sale,
                   enabled)
values (
           # user_id
           '2',
           # genre_id
           '26',
           # image
           'https://mylibraryapp.com/images/a1d5583b-55a6-4952-a32d-5fcb18e39da5.png',
           # title
           'Producing Open Source Software',
           # author
           'Karl Fogel',
           # publisher
           'O''Reilly',
           # isbn
           '978-0-596-00759-1',
           # year
           '2011',
           # number_of_pages
           '279',
           # description
           'Producing Open Source Software is a book about the human side of open source development. It describes how successful projects operate, the expectations of users and developers, and the culture of free software. The book is released under an open copyright. You can buy it in bookstores, order copies from O''Reilly Media, or browse and download it here.',
           # cover_type
           'Solid',
           # sale
           '0',
           # enabled
           '1'
       );

insert into books (user_id,
                   genre_id,
                   image,
                   title,
                   author,
                   publisher,
                   isbn,
                   year,
                   number_of_pages,
                   description,
                   cover_type,
                   sale,
                   enabled)
values (
           # user_id
           '2',
           # genre_id
           '57',
           # image
           'https://mylibraryapp.com/images/af0e0874-4b77-4422-aad3-9a17bd0938fb.png',
           # title
           'Краткая история Франции',
           # author
           'Норвич Джон',
           # publisher
           'КоЛибри',
           # isbn
           '978-5-389-14975-5',
           # year
           '2020',
           # number_of_pages
           '625',
           # description
           'Известный британский историк и автор Джон Норвич дает всесторонний обзор прошлого страны, сделавшей для европейской культуры больше любого другого государства. «История Франции — это не только Наполеон, Жанна д’Арк и Людовик XIV. Я расскажу о судьбе несчастных тамплиеров в руках одиозного Филиппа Красивого и о событиях, произошедших с его дочерьми в Нельской башне; о прекрасной мадам де Помпадур и противоречивой мадам де Ментенон; о Луи-Филиппе, почти забытом сегодня, но, наверное, лучшем короле в истории страны; и это только начало. Первая глава в быстром темпе сопроводит нас от галлов и Юлия Цезаря до Карла Великого, охватив около восьми столетий. Последняя глава расскажет о пяти годах Второй мировой войны — 1945 год заканчивает одну эпоху и начинает новую». (Джон Норвич)',
           # cover_type
           'Solid',
           # sale
           '0',
           # enabled
           '1'
       );

insert into books (user_id,
                   genre_id,
                   image,
                   title,
                   author,
                   publisher,
                   isbn,
                   year,
                   number_of_pages,
                   description,
                   cover_type,
                   sale,
                   enabled)
values (
           # user_id
           '2',
           # genre_id
           '57',
           # image
           'https://mylibraryapp.com/images/bc5f66e5-9c17-4ffd-b0e5-63fbfb8e4089.png',
           # title
           'Гегель',
           # author
           'Гегель Георг',
           # publisher
           'Эксмо',
           # isbn
           '978-5-04-094438-5',
           # year
           '2018',
           # number_of_pages
           '560',
           # description
           'Великому немецкому философу Георгу Гегелю выпало жить в бурную эпоху. Научная и промышленная революция конца XVIII века и идеи гуманистов Просвещения, Великая французская революция под знаменами свободы, равенства и братства, а затем долгие наполеоновские войны… Самая подходящая ситуация для рождения новых философских теорий и рассуждений о правах человека, о возможностях человеческого разума, о соотношении духовного и материального начал. Именно таковы были главные вопросы философии классического немецкого идеализма, символом которого является Гегель. Знакомство с системой великого философа с избранных глав из его наиболее известных произведений, представленных в этой книге. Это «Введение в историю философии», «Лекции по эстетике», а также входившие в «Энциклопедию философских наук» работы «Наука логики» и «Философия природы» (последняя представлена разделом «Механика»).',
           # cover_type
           'Solid',
           # sale
           '0',
           # enabled
           '1'
       );

insert into books (user_id,
                   genre_id,
                   image,
                   title,
                   author,
                   publisher,
                   isbn,
                   year,
                   number_of_pages,
                   description,
                   cover_type,
                   sale,
                   enabled)
values (
           # user_id
           '2',
           # genre_id
           '57',
           # image
           'https://mylibraryapp.com/images/c7175f25-232b-4479-8668-43a14e8d3a29.png',
           # title
           'Фрейд Зигмунд',
           # author
           'Фрейд Зигмунд',
           # publisher
           'Эксмо',
           # isbn
           '978-5-699-83814-1',
           # year
           '2016',
           # number_of_pages
           '608',
           # description
           'Зигмунд Фрейд - знаменитый австрийский ученый, психиатр и невролог, основатель психоанализа. Его новаторские идеи, критиковавшиеся в научном сообществе, тем не менее оказали огромное влияние на психологию, медицину, социологию, антропологию, литературу и искусство XX века. Среди крупнейших достижений Фрейда: обоснование понятия "бессознательное", разработка теории эдипова комплекса, создание метода свободных ассоциаций и методики толкования сновидений. В настоящем издании собраны самые значимые и популярные труды философа: "Психопатология обыденной жизни", "Толкование сновидений" и "Пять лекций о психоанализе". Философские трактаты как нельзя лучше отражают позицию автора и дарят читателю возможность оценить творческое наследие Фрейда.',
           # cover_type
           'Solid',
           # sale
           '0',
           # enabled
           '1'
       );

insert into books (user_id,
                   genre_id,
                   image,
                   title,
                   author,
                   publisher,
                   isbn,
                   year,
                   number_of_pages,
                   description,
                   cover_type,
                   sale,
                   enabled)
values (
           # user_id
           '2',
           # genre_id
           '57',
           # image
           'https://mylibraryapp.com/images/db60c98c-61dc-40f9-b5c8-df39cf42e1a9.png',
           # title
           'Краткая история Англии',
           # author
           'Дженкинс Саймон',
           # publisher
           'КоЛибри',
           # isbn
           '978-5-389-07036-3',
           # year
           '2020',
           # number_of_pages
           '416',
           # description
           'История Англии окутана для нас дымкой приключенческих романов и исторических фильмов. И эта книга, повествующая об основных вехах в истории державы, некогда владевшей огромными территориями, пережившей множество потрясений, религиозный раскол, революции, две мировые войны, читается как захватывающий роман. Сэр Саймон Дженкинс, член Королевского литературного общества, журналист и автор нашумевших книг по истории и архитектуре, написал ее с любовью и знанием дела, основываясь на богатом документальном материале. Исторически точное повествование не стало от этого менее увлекательным. «Краткая история Англии» вместила удивительно много бурных событий, предопределивших ту уникальную роль, которую сыграла эта страна в истории Европы да и всего мира. Сэр Саймон Дженкинс, член Королевского литературного общества, влиятельный публицист, колумнист Guardian, был возведен в рыцарское достоинство за заслуги перед журналистикой. Автор бестселлеров «Тысяча лучших церквей Англии» и «Тысяча лучших домов Англии». Персонажи этой книги – короли и политики, завоеватели и святые, аристократы и простолюдины. По словам автора, драматическая история Англии состоит из череды триумфов и трагедий. Нормандское завоевание, Великая хартия вольностей, битва при Азенкуре, жены Генриха VIII, Елизавета I, Кромвель, Гладстон, Дизраэли, Черчилль… Обо всем этом Саймон Дженкинс рассказывает удивительно ярко и динамично, с любовью и истинно английским юмором. И прошлое оживает на страницах «Краткой истории Англии».',
           # cover_type
           'Solid',
           # sale
           '0',
           # enabled
           '1'
       );

insert into books (user_id,
                   genre_id,
                   image,
                   title,
                   author,
                   publisher,
                   isbn,
                   year,
                   number_of_pages,
                   description,
                   cover_type,
                   sale,
                   enabled)
values (
           # user_id
           '2',
           # genre_id
           '57',
           # image
           'https://mylibraryapp.com/images/e8c10239-0f0b-486a-b5c1-472b61c84bbb.png',
           # title
           'Декарт',
           # author
           'Декарт',
           # publisher
           'Бомбора',
           # isbn
           '978-5-04-103169-5',
           # year
           '2019',
           # number_of_pages
           '560',
           # description
           'В настоящий том входят произведения французского философа XVII в., представляющие достаточно полную картину его воззрений на мир, познание, человека: «Рассуждения о методе», «Начала философии», «Страсти души».',
           # cover_type
           'Solid',
           # sale
           '0',
           # enabled
           '1'
       );

insert into books (user_id,
                   genre_id,
                   image,
                   title,
                   author,
                   publisher,
                   isbn,
                   year,
                   number_of_pages,
                   description,
                   cover_type,
                   sale,
                   enabled)
values (
           # user_id
           '2',
           # genre_id
           '57',
           # image
           'https://mylibraryapp.com/images/fb53ecef-2318-434a-99f0-e6723c112f2d.png',
           # title
           'Аристотель',
           # author
           'Аристотель',
           # publisher
           'Эксмо',
           # isbn
           '978-5-04-094436-1',
           # year
           '2018',
           # number_of_pages
           '544',
           # description
           'Благодаря Аристотелю философия превратилась в систему и стала питательной почвой, взрастившей множество научных дисциплин.Талантливый педагог, великий ученый - Аристотель изучал строение Солнечной системы, писал о государстве и политике, о происхождении животных и человеческой душе, о боге, о красноречии. Предлагаем вам познакомиться с избранными главами самых известных трудов древнегреческого гения — "Этикой", "Политикой" и "Риторикой", а также самыми популярными афоризмами.',
           # cover_type
           'Solid',
           # sale
           '0',
           # enabled
           '1'
       );